In [1]:
import pandas as pd

Get dataset from https://github.com/justmarkham/pandas-videos

In [2]:
# read a dataset of movie reviewers (modifying the default parameter values for read_table)
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols, index_col='user_id')

In [3]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [4]:
users.shape

(943, 4)

In [6]:
# check if there are duplicate zipcodes
users.zip_code.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

A `True` is returned if there was an entry previous to it (above it) that was identical.

In [7]:
# count the number of duplicates
users.zip_code.duplicated().sum()

148

There are 148 duplicate zipcodes.

In [8]:
# check if there are entire rows duplicated
users.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

A `True` is returned if there an entire row is identical to a previous row.

In [9]:
# count the number of duplicate rows
users.duplicated().sum()

7

In [10]:
# identify the duplicated rows
users.loc[users.duplicated(), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

Default is `keep='first'`, which means 'mark duplicate as `True` except for the first occurence.

In [11]:
users.loc[users.duplicated(keep='first'), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [12]:
users.loc[users.duplicated(keep='last'), :]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [13]:
users.loc[users.duplicated(keep=False), :]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

Use `.drop_duplicates()` to drop duplicates. The default is `keep='first'`. It doesn't occur `inplace` by default, but we can set the attribute `inplace=True`.

In [14]:
users.drop_duplicates(keep='first').shape

(936, 4)

What if we wanted to consider only certain columns when identifying duplicates? For example, let's assume we think 'age' + 'zipcode' should be a unique identifier in this dataset.

In [16]:
users.duplicated(subset=['age', 'zip_code']).sum()

16

In [17]:
users.drop_duplicates(subset=['age', 'zip_code']).shape

(927, 4)